In [1]:
import pandas as pd
import numpy as np

# DataFrame Grouping

The `groupby` method in Pandas is used to split the data into groups based on some criteria. It is often used to perform operations on each of these groups independently, such as aggregation, transformation, or filtration.

<img src="./images/DF_grouping.webp" style="height:300px">

By groupby method in Pandas we perform the "Split-Apply-Combine" Strategy.

Here's how it works:

1. Splitting: You start by splitting your data into groups based on a column.
2. Applying: You apply a function to each group independently.
3. Combining: The results are then combined into a new DataFrame.

<img src="./images/split-apply-combine.svg" style="height:300px">

Here is a basic example:

In [2]:
# Sample DataFrame
data = {
    'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Values': [1, 2, 3, 4, 5, 6]
}
df = pd.DataFrame(data)
df

  Category  Values
0        A       1
1        A       2
2        B       3
3        B       4
4        C       5
5        C       6

In [3]:
# Group by 'Category' and calculate the sum of 'Values'
grouped = df.groupby('Category')['Values'].sum()
grouped

Category
A     3
B     7
C    11
Name: Values, dtype: int64


## Examples on drinks dataset.

### Load data

In [4]:
# load datasets
df = pd.read_csv('../../../datasets/various/drinks.csv')
# remove some 'beer' and 'spirit' columns
df = df.drop(['beer_servings', 'spirit_servings'], axis=1)
df.head(5)

       country  wine_servings  total_litres_of_pure_alcohol continent
0  Afghanistan              0                           0.0        AS
1      Albania             54                           4.9        EU
2      Algeria             14                           0.7        AF
3      Andorra            312                          12.4        EU
4       Angola             45                           5.9        AF

## Groupby Method

df.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=NoDefault.no_default, observed=False, dropna=True)

In [5]:
continents_group = df.groupby('continent')
for continet,continet_df in continents_group:
	print(f'The DF for continent: {continet}')
	print(continet_df.head(5))
	print()

The DF for continent: AF
         country  wine_servings  total_litres_of_pure_alcohol continent
2        Algeria             14                           0.7        AF
4         Angola             45                           5.9        AF
18         Benin             13                           1.1        AF
22      Botswana             35                           5.4        AF
26  Burkina Faso              7                           4.3        AF

The DF for continent: AS
        country  wine_servings  total_litres_of_pure_alcohol continent
0   Afghanistan              0                           0.0        AS
12      Bahrain              7                           2.0        AS
13   Bangladesh              0                           0.0        AS
19       Bhutan              0                           0.4        AS
24       Brunei              1                           0.6        AS

The DF for continent: EU
       country  wine_servings  total_litres_of_pure_alcohol continent
1      Albania             54                           4.9        EU
3      Andorra            312                          12.4        EU
7      Armenia             11                           3.8        EU
9      Austria            191                           9.7        EU
10  Azerbaijan              5                           1.3        EU

The DF for continent: OC
              country  wine_servings  total_litres_of_pure_alcohol continent
8           Australia            212                          10.4        OC
40       Cook Islands             74                           5.9        OC
59               Fiji              1                           2.0        OC
89           Kiribati              1                           1.0        OC
106  Marshall Islands              0                           0.0        OC

The DF for continent: SA
      country  wine_servings  total_litres_of_pure_alcohol continent
6   Argentina            221                           8.3        SA
20    Bolivia              8                           3.8        SA
23     Brazil             16                           7.2        SA
35      Chile            172                           7.6        SA
37   Colombia              3                           4.2        SA

### Groupby Object

groupby() method returns a [GroupBy object](https://pandas.pydata.org/docs/reference/groupby.html)

In [6]:
# get gorups as Dict {group name -> group labels}.
print(continents_group.groups)
print('~'*80)
print(continents_group.indices)

{'AF': [2, 4, 18, 22, 26, 27, 28, 29, 31, 33, 34, 38, 39, 47, 49, 53, 55, 56, 58, 62, 63, 66, 70, 71, 88, 95, 96, 97, 100, 101, 104, 107, 108, 114, 115, 117, 123, 124, 142, 148, 150, 152, 153, 158, 159, 162, 164, 172, 175, 179, 183, 191, 192], 'AS': [0, 12, 13, 19, 24, 30, 36, 46, 77, 78, 79, 80, 82, 85, 86, 87, 90, 91, 92, 94, 102, 103, 112, 116, 119, 127, 128, 134, 137, 138, 141, 149, 154, 161, 167, 168, 169, 171, 176, 177, 181, 186, 189, 190], 'EU': [1, 3, 7, 9, 10, 15, 16, 21, 25, 42, 44, 45, 48, 57, 60, 61, 64, 65, 67, 75, 76, 81, 83, 93, 98, 99, 105, 111, 113, 120, 126, 135, 136, 139, 140, 147, 151, 155, 156, 160, 165, 166, 170, 180, 182], 'OC': [8, 40, 59, 89, 106, 110, 118, 121, 125, 129, 131, 146, 157, 173, 178, 187], 'SA': [6, 20, 23, 35, 37, 52, 72, 132, 133, 163, 185, 188]}
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
{'AF': array([  2,   4,  18,  22,  26,  27,  28,  29,  31,  33,  34,  38,  39,
        47,  49,  53,  55,  56,  58,  62,  63,  66,  70,  71,  88,  95,
        96,  97, 100, 101, 104, 107, 108, 114, 115, 117, 123, 124, 142,
       148, 150, 152, 153, 158, 159, 162, 164, 172, 175, 179, 183, 191,
       192]), 'AS': array([  0,  12,  13,  19,  24,  30,  36,  46,  77,  78,  79,  80,  82,
        85,  86,  87,  90,  91,  92,  94, 102, 103, 112, 116, 119, 127,
       128, 134, 137, 138, 141, 149, 154, 161, 167, 168, 169, 171, 176,
       177, 181, 186, 189, 190]), 'EU': array([  1,   3,   7,   9,  10,  15,  16,  21,  25,  42,  44,  45,  48,
        57,  60,  61,  64,  65,  67,  75,  76,  81,  83,  93,  98,  99,
       105, 111, 113, 120, 126, 135, 136, 139, 140, 147, 151, 155, 156,
       160, 165, 166, 170, 180, 182]), 'OC': array([  8,  40,  59,  89, 106, 110, 118, 121, 125, 129, 131, 146, 157,
       173, 178, 187]), 'SA': array([  6,  20,  23,  35,  37,  52,  72, 132, 133, 163, 185, 188])}

In [7]:
# Compute count of group, excluding missing values.
continents_group.count()

           country  wine_servings  total_litres_of_pure_alcohol
continent
AF              53             53                            53
AS              44             44                            44
EU              45             45                            45
OC              16             16                            16
SA              12             12                            12

In [8]:
# Compute max of group values
continents_group.max()

                  country  wine_servings  total_litres_of_pure_alcohol
continent
AF               Zimbabwe            233                           9.1
AS                  Yemen            123                          11.5
EU         United Kingdom            370                          14.4
OC                Vanuatu            212                          10.4
SA              Venezuela            221                           8.3

In [9]:
# Compute sum of group values
continents_group.sum()

,country,wine_servings,total_litres_of_pure_alcohol
continent,,,
AF,AlgeriaAngolaBeninBotswanaBurkina FasoBurundiC...,862,159.4
AS,AfghanistanBahrainBangladeshBhutanBruneiCambod...,399,95.5
EU,AlbaniaAndorraArmeniaAustriaAzerbaijanBelarusB...,6400,387.8
OC,AustraliaCook IslandsFijiKiribatiMarshall Isla...,570,54.1
SA,ArgentinaBoliviaBrazilChileColombiaEcuadorGuya...,749,75.7

In [10]:
# Take the nth row from each group if n is an int, or a subset of rows if n is a list of ints.
# continents_group.nth(1)
continents_group.nth([1,-1])

            country  wine_servings  total_litres_of_pure_alcohol continent
3           Andorra            312                          12.4        EU
4            Angola             45                           5.9        AF
12          Bahrain              7                           2.0        AS
20          Bolivia              8                           3.8        SA
40     Cook Islands             74                           5.9        OC
182  United Kingdom            195                          10.4        EU
187         Vanuatu             11                           0.9        OC
188       Venezuela              3                           7.7        SA
190           Yemen              0                           0.1        AS
192        Zimbabwe              4                           4.7        AF

## More examples

### Example 1: Sales Data

Scenario: You have a dataset of sales records for a store, including the date, product category, and sales amount. You want to analyze the total sales by category and month.

In [11]:
# Generate sample sales data
np.random.seed(42)
dates = pd.date_range('2023-01-01', periods=100, freq='D')
categories = ['Electronics', 'Clothing', 'Furniture']
sales_data = {
    'Date': np.random.choice(dates, 100),
    'Category': np.random.choice(categories, 100),
    'Sales_Amount': np.random.uniform(20, 500, 100)
}
df_sales = pd.DataFrame(sales_data)
df_sales

         Date     Category  Sales_Amount
0  2023-02-21     Clothing     99.034810
1  2023-04-03  Electronics    276.362921
2  2023-01-15  Electronics    252.718386
3  2023-03-13  Electronics    352.369296
4  2023-03-02  Electronics    149.317920
..        ...          ...           ...
95 2023-03-26  Electronics    325.439657
96 2023-03-21  Electronics    140.221673
97 2023-03-23  Electronics    303.138007
98 2023-02-22    Furniture    489.868572
99 2023-01-24    Furniture    253.636233

[100 rows x 3 columns]

In [12]:
# Group by 'Category' and calculate total sales
grouped_sales = df_sales.groupby('Category')['Sales_Amount'].sum()
grouped_sales

Category
Clothing        5972.336458
Electronics     9418.031641
Furniture      12012.969786
Name: Sales_Amount, dtype: float64

In [13]:
# add Month column, extract from 'Date':
df_sales['Month'] = df_sales['Date'].dt.to_period('M')

# Group by 'Category' and 'Month' and calculate total sales
grouped_sales_month = df_sales.groupby(['Category', 'Month'])['Sales_Amount'].sum()
grouped_sales_month

Category     Month
Clothing     2023-01    1822.123962
             2023-02    2247.954943
             2023-03    1797.813431
             2023-04     104.444121
Electronics  2023-01    2017.608317
             2023-02    2338.092129
             2023-03    4043.126160
             2023-04    1019.205035
Furniture    2023-01    5414.733308
             2023-02    1619.229506
             2023-03    4350.727094
             2023-04     628.279878
Name: Sales_Amount, dtype: float64

### Example 2: Customer Transactions

*Scenario*: You have a dataset of customer transactions, including customer ID, transaction date, and transaction amount. You want to perform the following tasks:

1. Calculate the total transaction amount for each customer.
1. Find the average transaction amount per customer.
1. Identify customers with transactions above a certain threshold.
1. Analyze monthly transactions for each customer.

In [14]:
# Generate sample customer transactions data
np.random.seed(42)
customer_ids = np.arange(1, 11)
dates = pd.date_range('2023-01-01', periods=100, freq='D')
transaction_data = {
    'Customer_ID': np.random.choice(customer_ids, 100),
    'Transaction_Date': np.random.choice(dates, 100),
    'Transaction_Amount': np.random.uniform(10, 1000, 100)
}
df_transactions = pd.DataFrame(transaction_data)
df_transactions

    Customer_ID Transaction_Date  Transaction_Amount
0             7       2023-01-12          285.860000
1             4       2023-02-03          909.183227
2             8       2023-02-02          247.166272
3             5       2023-02-17          153.445923
4             7       2023-01-23          494.558233
..          ...              ...                 ...
95           10       2023-01-02           25.302050
96            9       2023-01-02          929.035377
97            7       2023-04-02          433.902307
98            9       2023-02-23          966.988271
99            8       2023-03-28          963.983777

[100 rows x 3 columns]

In [15]:
# Task 1: Calculate the total transaction amount for each customer
total_transaction_amount = df_transactions.groupby('Customer_ID')['Transaction_Amount'].sum()
print("Total transaction amount for each customer:")
total_transaction_amount

Total transaction amount for each customer:

Customer_ID
1     4184.441341
2     3593.600771
3     5195.621393
4     4958.270198
5     3544.582543
6     2582.612421
7     6638.668663
8     7900.080139
9     7658.588096
10    5328.930893
Name: Transaction_Amount, dtype: float64

In [16]:
# Task 2: Find the average transaction amount per customer
average_transaction_amount = df_transactions.groupby('Customer_ID')['Transaction_Amount'].mean()
print("\nAverage transaction amount per customer:")
average_transaction_amount

Average transaction amount per customer:

Customer_ID
1     597.777334
2     359.360077
3     577.291266
4     550.918911
5     354.458254
6     430.435403
7     603.515333
8     526.672009
9     638.215675
10    484.448263
Name: Transaction_Amount, dtype: float64

In [17]:
# Task 3: Identify customers with transactions above a certain threshold (e.g., 5000)
threshold = 5000
high_value_customers = total_transaction_amount[total_transaction_amount > threshold]
print("\nCustomers with total transactions above threshold:")
high_value_customers

Customers with total transactions above threshold:

Customer_ID
3     5195.621393
7     6638.668663
8     7900.080139
9     7658.588096
10    5328.930893
Name: Transaction_Amount, dtype: float64

In [18]:
# Task 4: Analyze monthly transactions for each customer
df_transactions['Month'] = df_transactions['Transaction_Date'].dt.to_period('M')
monthly_transactions = df_transactions.groupby(['Customer_ID', 'Month'])['Transaction_Amount'].sum()
print("\nMonthly transactions for each customer:")
monthly_transactions

Monthly transactions for each customer:

Customer_ID  Month
1            2023-01    2669.730527
             2023-02     933.575969
             2023-03     581.134846
2            2023-01    1482.921170
             2023-02     559.648803
             2023-03    1551.030797
3            2023-01     185.339573
             2023-02    2068.273528
             2023-03    1668.905923
             2023-04    1273.102370
4            2023-01     627.652638
             2023-02    2456.910685
             2023-03    1704.506904
             2023-04     169.199971
5            2023-01     661.036763
             2023-02    1574.822042
             2023-03    1043.361527
             2023-04     265.362211
6            2023-01     822.082280
             2023-03    1220.113203
             2023-04     540.416937
7            2023-01    3227.060661
             2023-02    2584.837702
             2023-03     392.867993
             2023-04     433.902307
8            2023-01    1261.213718
             2023-02    2642.995766
             2023-03    2350.151213
             2023-04    1645.719443
9            2023-01    1592.419583
             2023-02    3238.115426
             2023-03    2828.053088
10           2023-01     766.781430
             2023-02    1535.014043
             2023-03    2099.143429
             2023-04     927.991991
Name: Transaction_Amount, dtype: float64